Web 표준

1. 웹 표준을 지켜야 하는 이유
1) 세계적인 웹 기술 표준을 주도하고 있는 W3C의 HTML4.1, XHTML1.0, CSS1/2, DOM 등의 구현 스펙이 매우 상세하고 이를 지원하는 브라우저들이 계속 늘어 남에 따라
더 이상 웹페이지가 다르게 보이거나 동작하지 않는 현상은 거의 사라지게 되었다. 다만 웹브라우저간 이종 기능이 아직은 상존하고 있고 예전에 개발되어 사용된 오래된 브라우
저 사용자들의 불편함을 고려해 같은 기능이라도 호환 가능하도록 해 주는 표준을 통한 웹페이지 제작이 요구되고 있다. 
2) 버전이 올라갈 수록 새로운 기능이 추가되고 이전 기능은 폐기 된다. 사용자 측면에서는 예전 기능을 계속 유지 해주어 호완성을 유지해 줄 필요성이 있다.
그러므로 예전 버전을 사용함으로 이 때 사용된 비표준 문법들이 계속 사용되어 접근성에 위해를 주게된다.
3) 우리나라는 IE를 많이 사용하기 때문에 웹 표준이 지켜지지 않는 사이트가 있다.
4) table 구조를 div로 바꾸고 font, b 태그들을 css를 사용하면 코드의 양이 줄어들고 로딩 속도도 빨라진다.
5) 유지보수 효율성이 늘어나고, 재개발 효율성이 증대 된다

2. 구조, 표현, 동작을 분리해야 한다
1) HTML과 CSS로 분리함으로 구조는 변하지 않은 채 여러 가지 디자인을 적용하거나 상황에 따라 쉽게 디자인을 변경하는 게 가능하다
2) 한 개의 HTML과 시각 장애인용 CSS와 텍스트용 CSS 그리고 기존의 CSS를 사용하여 문서의 구조가 섞이지 않아 시각 장애인의 접근성에 도움이 된다.
3) 우리나라는 문서의 구조적인 요소인 h1, ul, strong, blockquote, cite 보다는 font, table, br을 사용하여 요소가 의미적인 내용과 섞여 있어 어떤 것이 중요한 지, 제목에 해당되는 지, 
강조할 것과 인용된 것이 어떤 것인지 알 수 없다.
4) 디자인 요소가 CSS로 분리되면 의미있고 구조환 된 내용만 남게되며, CSS가 제거되어도 의미를 이해하는데 문제가 없게 된다. 이것이 웹 접근성 문제가 해결하는데도 도움이 된다.
5) 자바스크립트를 홈페이지에 마구 쑤셔 넣는 동적 행동 양식이 접근성 및 사용서을 저해하고 복잡겅을 높인다. 
6) 최근  구조에서 행동 양식을 분리하는 다양한 방법론이 제안되면서 접근성을 해치지 않으면서 코드를 간단하게 하는 다양한 방법들을 적용할 수 있게 되었다

3. 최소한의 디버깅을 하자
1) 웹표준을 지키고 CSS를 통해 구조와 표현을 분리해도 유효성 검사 즉 디버깅을 해야한다.
2) HTML과 XHTML 문서뿐만 아니라 CSS 역시 자신이 사용한 표현식과 문법이 제대로되어 있는지 알려 주는 도구가 존재 한다. 
이 도구를 통해 반복되는 몇 가지 실수를 간단한 수정으로 검사를 통과할 수 있다.
3) DOM과 자바스크립트도 표준 문법을 사용했는지 확인 과정이 필요하다.
4) Mozilla Firefox의 탑재된 자바 스크립트 디버거 만으로도 인터넷 익스플로러와 공통으로 생기는 문제점을 발견 해결할 수 있고, 비표준으로 사용된 문법을 판별해 낼 수 있다
